yienlyu/STM32-camera-test/Drivers/BSP/stm32_ov5640_camera.c
  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Init DCMI PWR_ENABLE Pin */
    /* Enable GPIO clock */
    __HAL_RCC_GPIOH_CLK_ENABLE();

    gpio_init_structure.Pin       = GPIO_PIN_14;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOH, &gpio_init_structure);

    /* Assert the camera POWER_DOWN pin (active high) */
    HAL_GPIO_WritePin(GPIOH, GPIO_PIN_14, GPIO_PIN_SET);
  }

  return ret;
}

/**
  * @brief  CAMERA power up
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_PwrUp(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef gpio_init_structure;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Init DCMI PWR_ENABLE Pin */
    /* Enable GPIO clock */
    __HAL_RCC_GPIOH_CLK_ENABLE();

    gpio_init_structure.Pin       = GPIO_PIN_14;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOH, &gpio_init_structure);

    /* Assert the camera POWER_DOWN pin (active high) */
    HAL_GPIO_WritePin(GPIOH, GPIO_PIN_14, GPIO_PIN_RESET);
  }

  return ret;
}
/**
  * @brief  This function handles DCMI interrupt request.
  * @param  Instance Camera instance
  * @retval None
  */
void BSP_CAMERA_IRQHandler(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  HAL_DCMI_IRQHandler(&hcamera_dcmi);
}

/**
  * @brief  This function handles DCMI DMA interrupt request.
  * @param  Instance Camera instance
  * @retval None
  */
void BSP_CAMERA_DMA_IRQHandler(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  HAL_DMA_IRQHandler(hcamera_dcmi.DMA_Handle);
}

/**
  * @}
  */

/** @defgroup STM32H747I_DISCO_CAMERA_Private_Functions Private Functions
  * @{
  */

/**
  * @brief  Get the capture size in pixels unit.
  * @param  Resolution  the current resolution.
  * @param  PixelFormat Camera pixel format
  * @retval capture size in 32-bit words.
  */
static int32_t GetSize(uint32_t Resolution, uint32_t PixelFormat)
{
  uint32_t size = 0;
  uint32_t pf_div;
  if(PixelFormat == CAMERA_PF_RGB888)
  {
    pf_div = 3; /* each pixel on 3 bytes so 3/4 words */
  }
  else
  {
    pf_div = 2; /* each pixel on 2 bytes so 1/2 words*/
  }
  /* Get capture size */
  switch (Resolution)
  {
  case CAMERA_R160x120:
    size =  ((uint32_t)(160*120)*pf_div)/4U;
    break;
  case CAMERA_R320x240:
    size =  ((uint32_t)(320*240)*pf_div)/4U;
    break;
  case CAMERA_R480x272:
    size =  ((uint32_t)(480*272)*pf_div)/4U;
    break;
  case CAMERA_R640x480:
    size =  ((uint32_t)(640*480)*pf_div)/4U;
    break;
  case CAMERA_R800x480:
    size =  ((uint32_t)(800*480)*pf_div)/4U;
    break;
  default:
    break;
  }

  return (int32_t)size;
}

/**
  * @brief  Initializes the DCMI MSP.
  * @param  hdcmi  DCMI handle
  * @retval None
  */
static void DCMI_MspInit(DCMI_HandleTypeDef *hdcmi)
{
	  static DMA_HandleTypeDef hdma_handler;
	  GPIO_InitTypeDef gpio_init_structure;

	  /*** Enable peripherals and GPIO clocks ***/
	  /* Enable DCMI clock */
	  __HAL_RCC_DCMI_CLK_ENABLE();

	  /* Enable DMA2 clock */
	  __HAL_RCC_DMA2_CLK_ENABLE();

	  /* Enable GPIO clocks */
	  __HAL_RCC_GPIOA_CLK_ENABLE();
	  __HAL_RCC_GPIOE_CLK_ENABLE();
	  __HAL_RCC_GPIOH_CLK_ENABLE();
	  __HAL_RCC_GPIOI_CLK_ENABLE();

	  HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_SYSCLK, RCC_MCODIV_4);
	  __HAL_RCC_HSI48_ENABLE();
	  HAL_Delay(10); // HSI48 should start in 10ms


	  /*** Configure the GPIO ***/
	  /* Configure DCMI GPIO as alternate function */
	  gpio_init_structure.Pin       = GPIO_PIN_5;
	  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	  gpio_init_structure.Pull      = GPIO_NOPULL;
	  gpio_init_structure.Speed     = GPIO_SPEED_HIGH;
	  gpio_init_structure.Alternate = GPIO_AF10_DCMI;
	  HAL_GPIO_Init(GPIOE, &gpio_init_structure);


	  gpio_init_structure.Pin       = GPIO_PIN_5 | GPIO_PIN_8 | GPIO_PIN_9 | \
	                                  GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_14;
	  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	  gpio_init_structure.Pull      = GPIO_NOPULL;
	  gpio_init_structure.Speed     = GPIO_SPEED_HIGH;
	  gpio_init_structure.Alternate = GPIO_AF10_DCMI;
	  HAL_GPIO_Init(GPIOH, &gpio_init_structure);

	  gpio_init_structure.Pin       = GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_7;
	  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	  gpio_init_structure.Pull      = GPIO_NOPULL;
	  gpio_init_structure.Speed     = GPIO_SPEED_HIGH;
	  gpio_init_structure.Alternate = GPIO_AF10_DCMI;
	  HAL_GPIO_Init(GPIOI, &gpio_init_structure);

	  /*** Configure the DMA ***/
	  /* Set the parameters to be configured */
	  hdma_handler.Instance                 = BSP_CAMERA_DMA_INSTANCE;

	  hdma_handler.Init.Request             = DMA_REQUEST_0;
	  hdma_handler.Init.Direction           = DMA_PERIPH_TO_MEMORY;
	  hdma_handler.Init.PeriphInc           = DMA_PINC_DISABLE;
	  hdma_handler.Init.MemInc              = DMA_MINC_ENABLE;      /* Image captured by the DCMI is stored in memory */
	  hdma_handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
	  hdma_handler.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
	  hdma_handler.Init.Mode                = DMA_CIRCULAR;
	  hdma_handler.Init.Priority            = DMA_PRIORITY_HIGH;

	  /* Associate the initialized DMA handle to the DCMI handle */
	  __HAL_LINKDMA(hdcmi, DMA_Handle, hdma_handler);

	  /*** Configure the NVIC for DCMI and DMA ***/
	  /* NVIC configuration for DCMI transfer complete interrupt */
	  HAL_NVIC_SetPriority(DCMI_IRQn, 0x0F, 0);
	  HAL_NVIC_EnableIRQ(DCMI_IRQn);

	  /* NVIC configuration for DMA2D transfer complete interrupt */
	  HAL_NVIC_SetPriority(DMA2_Channel6_IRQn, 0x0F, 0);
	  HAL_NVIC_EnableIRQ(DMA2_Channel6_IRQn);

	  /* Configure the DMA stream */
	  HAL_DMA_Init(hdcmi->DMA_Handle);
}

/**
  * @brief  DeInitializes the DCMI MSP.
  * @param  hdcmi  DCMI handle
  * @retval None
  */
static void DCMI_MspDeInit(DCMI_HandleTypeDef *hdcmi)
{
  GPIO_InitTypeDef gpio_init_structure;

